Repository: eagerterrier/MimeTypes-Link-Icons
Catalog: languages/mimetypes-link-icons-*.po
Languages: de_de

source: Left
de_de: Links

source: Right
de_de: Rechts

source: General Settings
de_de: Allgemeine Einstellungen

source: Image Settings
de_de: Bild-Einstellungen

source: Advanced Settings
de_de: Erweiterte Einstellungen

source: MimeType Link Icons Settings
de_de: MimeType Link Icons Einstellungen

source: Settings
de_de: Einstellungen

source: Check All
de_de: Alle auswählen

source: Uncheck All
de_de: Alle abwählen

source: The <em><a href="%s">MimeTypes Link Icons</a></em> plugin will automatically add an icon next to links of the activated file types. If you like, you can also let the plugin add the file size of the linked file to the page.
de_de: Das <em><a href="%s">MimeTypes Link Icons</a></em> Plugin fügt automatisch ein Symbol neben den Links der aktivierten Dateitypen ein. Wenn Sie möchten, können Sie das Plugin auch die Dateigröße der verlinkten Datei auf der Seite hinzufügen lassen.

source: On this settings page you can specify the icon size, icon type (white matte gif or transparent png), icon alignment. You can also select the file types for which this plugin will be enabled.
de_de: Auf dieser Einstellungsseite können Sie die Symbolgröße, den Symboltyp (weißes, mattes gif oder transparentes png) und die Symbolausrichtung festlegen. Sie können auch die Dateitypen auswählen, für die dieses Plugin aktiviert werden soll.

source: In the advanced settings, you can enable <em>"exclusion classnames"</em>, enable the display of the <em>file size</em> of a linked file and/or choose to use <em>asynchronous replacement</em>.
de_de: In den erweiterten Einstellungen können Sie <em>"Klassennamen ausschließen"</em> aktivieren, die Anzeige der <em>Dateigröße</em> einer verknüpften Datei aktivieren und/oder das <em>asynchrone Ersetzen</em> wählen.

source: <strong>"Exclusion classnames"</strong> works as follows:
de_de: <strong>"Klassennamen ausschließen"</strong> funktioniert wie folgt:

source: The plugin will look for the classname in your document and will remove the Mimetypes link icons (and file sizes) from all links wrapped within that class. You can add several classnames, just separate them with a comma.
de_de: Das Plugin sucht nach dem Klassennamen in Ihrem Dokument und entfernt die Mimetypes-Link-Symbole (und Dateigrößen) von allen Links, die in dieser Klasse enthalten sind. Sie können mehrere Klassennamen hinzufügen, indem Sie sie durch ein Komma trennen.

source: There is even some more advanced functionality available: for instance an <em>output filter</em> for the file size output and a way to add the plugin's functionality to widgets or other areas of your blog outside of the main content area.
de_de: Es gibt sogar einige erweiterte Funktionen: zum Beispiel einen <em>Ausgabefilter</em> für die Ausgabe der Dateigröße und eine Möglichkeit, die Funktionen des Plugins in Widgets oder andere Bereiche Ihres Blogs außerhalb des Hauptinhaltsbereichs einzufügen.

source: For more information on these tasty extras, have a look at the %1$sFAQ%2$s
de_de: Weitere Informationen zu diesen praktischen Extras finden Sie in den %1$sFAQ%2$s

source: For more information:
de_de: Für weitere Informationen:

source: Official plugin page
de_de: Offizielle Plugin Seite

source: Blog post about this plugin
de_de: Blogbeitrag über dieses Plugin

source: MimeTypes Link Icons can't resolve the following url, please make sure the file referred to exists. URL: %s
de_de: MimeTypes Link Icons kann die folgende URL nicht auflösen. Bitte stellen Sie sicher, dass die angegebene Datei existiert. URL: %s

source: Invalid image size received
de_de: Unzulässige Bildgröße erhalten

source: the setting has not been changed.
de_de: die Einstellung wurde nicht geändert.

source: Invalid image type received
de_de: Unzulässiger Bildtyp erhalten

source: Invalid image placement received
de_de: Unzulässige Bildplatzierung erhalten

source: Invalid rounding precision received
de_de: Unzulässige Rundungsgenauigkeit erhalten

source: Invalid cache time received
de_de: Unzulässige Cache-Zeit erhalten

source: One or more invalid classname(s) received, the values have been cleaned - this may just be the removal of spaces -, please check.
de_de: Ein oder mehrere ungültige(r) Klassenname(n) erhalten, die Werte wurden bereinigt - dies könnte nur das Entfernen von Leerzeichen sein -, bitte überprüfen Sie dies.

source: No valid classname(s) received
de_de: Keine gültige(n) Klassenbezeichnung(en) erhalten

source: You do not have sufficient permissions to access this page.
de_de: Sie haben keine ausreichenden Berechtigungen, um auf diese Seite zuzugreifen.

source: Image Size
de_de: Bildgröße

source: Image Type
de_de: Bildtyp

source: Display images on left or right
de_de: Bilder links oder rechts anzeigen

source: Add images to <strong>%s</strong> uploads/files
de_de: Bilder zu <strong>%s</strong> Uploads/Dateien hinzufügen

source: Enable/Disable classnames?
de_de: Klassennamen aktivieren/deaktivieren?

source: Tick this box to have one or more <em>classname(s)</em> that will disable the mime type links (ie: around an image or caption).
de_de: Markieren Sie dieses Kästchen, um einen oder mehrere <em>Klassennamen</em> zu verwenden, die die Mime-Type-Links deaktivieren (z.B. um ein Bild oder eine Bildunterschrift).

source: You can change the classname(s) by editing the field below. If you want to exclude several classnames, separate them with a comma (,).
de_de: Sie können den/die Klassennamen ändern, indem Sie das Feld unten bearbeiten. Wenn Sie mehrere Klassennamen ausschließen möchten, trennen Sie sie durch ein Komma (,).

source: Show File Size?
de_de: Dateigröße anzeigen?

source: Display the <em>file size</em> of the attachment/linked file.
de_de: Anzeige der <em>Dateigröße</em> der angehängten/verknüpften Datei.

source: File size rounding precision:
de_de: Rundungsgenauigkeit der Dateigröße:

source: decimals
de_de: Dezimalstellen

source: sizes less than 1kB will always have 0 decimals
de_de: Größen kleiner als 1 kB haben immer 0 Dezimalstellen

source: Retrieving the file sizes of (external) files can be slow. If the file sizes of the files you link to do not change very often, you may want to cache the results. This will result in faster page loading for most end-users of your website.
de_de: Das Abrufen der Dateigrößen von (externen) Dateien kann langsam sein. Falls sich die Dateigrößen der Dateien, auf die Sie verlinken, nicht oft ändern, sollten Sie die Ergebnisse im Cache halten. Dadurch wird die Seite für die meisten Endnutzer Ihrer Website schneller geladen.

source: Cache retrieved file sizes.
de_de: Zwischenspeichern der abgerufenen Dateigrößen.

source: Amount of time to cache retrieved file sizes:
de_de: Dauer für die Zwischenspeicherung der abgerufenen Dateigrößen:

source: hours
de_de: Stunden

source: Enable Asynchronous Replacement?
de_de: Asynchrones Ersetzen aktivieren?

source: Some themes or plugins may conflict with this plugin. If you find you are having trouble you can switch on asynchronous replacement which (instead of PHP) uses JavaScript to find your links.
de_de: Manche Themes oder Plugins können Konflikte mit diesem Plugin verursachen. Wenn Sie feststellen, dass Sie Probleme haben, können Sie das asynchrone Ersetzen einschalten, das (anstelle von PHP) JavaScript verwendet, um Ihre Links zu finden.

source: Tick box to enable <em>asynchronous replacement</em>.
de_de: Aktivieren Sie das Kontrollkästchen, um das <em>asynchrone Ersetzen</em> zu aktivieren.

source: Tick box to enable <em>asynchronous debug mode</em>.
de_de: Aktivieren Sie das Kontrollkästchen, um den <em>asynchronen Debug-Modus</em> zu aktivieren.

source: This will add file type icons next to links automatically. Change options in the <a href="options-general.php?page=mimetypes-link-icons">settings page</a>
de_de: Dadurch werden automatisch Symbole für den Dateityp neben Links hinzugefügt. Änderen Sie die Optionen auf der <a href="options-general.php?page=mimetypes-link-icons">Einstellungsseite</a>
